01  WS-AREA-1.                    PIC X(10). 
01  WS-AREA-2 REDEFINES WS-AREA-1. 
    05 WS-SUB-1 PIC 9(5). 
    05 WS-SUB-2 PIC 9(5). 

PROCEDURE DIVISION.
MOVE '1234567890' TO WS-AREA-1.
DISPLAY WS-SUB-1 WS-SUB-2. 
STOP RUN.